week5/app/models/user.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest", "provider", "uid") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def self.from_omniauth(auth_hash)
    user = find_or_create_by(uid: auth_hash['uid'], provider: auth_hash['provider'])
    user.name = auth_hash['info']['name']
    user.email = auth_hash['info']['email']
    user.password = Devise.friendly_token[0,20]

    user.save!